In [13]:
 #step1:#importing required packages
import pandas as pd

In [14]:
#Mystics Of Machine Learning
#many blackboxes 
#some revealed but some not

#step2:loading data and create a dataframe having our data
#loading data
stock_broker_data=pd.read_csv('Stock_broker_Quarter_Analysis.csv')

#step3: creating a list with all columns of dataframe
stock_broker_data_col=stock_broker_data.columns.tolist()

In [15]:
print(stock_broker_data_col)

['Stock_broker_id', 'Succesful', 'Knowledge_level', 'Name', 'Sex', 'Age', 'Certified_trainings_so_far', 'Increments_so_far', 'Seating_Location', 'Experience_level']

In [16]:
type(stock_broker_data)

pandas.core.frame.DataFrame

In [17]:
stock_broker_data_col

['Stock_broker_id',
 'Succesful',
 'Knowledge_level',
 'Name',
 'Sex',
 'Age',
 'Certified_trainings_so_far',
 'Increments_so_far',
 'Seating_Location',
 'Experience_level']

In [18]:
stock_broker_data.head()

,Stock_broker_id,Succesful,Knowledge_level,Name,Sex,Age,Certified_trainings_so_far,Increments_so_far,Seating_Location,Experience_level
0,804,1,3,"Thomas, Master. Assad Alexander",male,24.0,0,1,NaN,C
1,756,1,2,"Hamalainen, Master. Viljo",male,24.0,1,1,NaN,S
2,470,1,3,"Baclini, Miss. Helene Barbara",female,24.0,2,1,NaN,C
3,645,1,3,"Baclini, Miss. Eugenie",female,24.0,2,1,NaN,C
4,79,1,2,"Caldwell, Master. Alden Gates",male,24.0,0,2,NaN,S

In [19]:
stock_broker_data['Succesful']

0      1
1      1
2      1
3      1
4      1
      ..
886    0
887    0
888    0
889    0
890    0
Name: Succesful, Length: 891, dtype: int64

In [20]:
#step4: create separate series for target variable
#dependent variable: 'Succesful'
target_variable=stock_broker_data['Succesful']

In [21]:
#step5: create separate series for unique_id variable
#unique_id
Unique_ID=stock_broker_data['Stock_broker_id']

In [22]:
type(target_variable)

#when we select single column from a dataframe, we get series

pandas.core.series.Series

In [23]:
target_variable

0      1
1      1
2      1
3      1
4      1
      ..
886    0
887    0
888    0
889    0
890    0
Name: Succesful, Length: 891, dtype: int64

In [24]:
stock_broker_data.head()

,Stock_broker_id,Succesful,Knowledge_level,Name,Sex,Age,Certified_trainings_so_far,Increments_so_far,Seating_Location,Experience_level
0,804,1,3,"Thomas, Master. Assad Alexander",male,24.0,0,1,NaN,C
1,756,1,2,"Hamalainen, Master. Viljo",male,24.0,1,1,NaN,S
2,470,1,3,"Baclini, Miss. Helene Barbara",female,24.0,2,1,NaN,C
3,645,1,3,"Baclini, Miss. Eugenie",female,24.0,2,1,NaN,C
4,79,1,2,"Caldwell, Master. Alden Gates",male,24.0,0,2,NaN,S

In [25]:
stock_broker_data=stock_broker_data.drop('Succesful',axis=1)

In [26]:
stock_broker_data

,Stock_broker_id,Knowledge_level,Name,Sex,Age,Certified_trainings_so_far,Increments_so_far,Seating_Location,Experience_level
0,804,3,"Thomas, Master. Assad Alexander",male,24.0,0,1,NaN,C
1,756,2,"Hamalainen, Master. Viljo",male,24.0,1,1,NaN,S
2,470,3,"Baclini, Miss. Helene Barbara",female,24.0,2,1,NaN,C
3,645,3,"Baclini, Miss. Eugenie",female,24.0,2,1,NaN,C
4,79,2,"Caldwell, Master. Alden Gates",male,24.0,0,2,NaN,S
...,...,...,...,...,...,...,...,...,...
886,860,3,"Razi, Mr. Raihed",male,NaN,0,0,NaN,C
887,864,3,"Sage, Miss. Dorothy Edith ""Dolly""",female,NaN,8,2,NaN,S
888,869,3,"van Melkebeke, Mr. Philemon",male,NaN,0,0,NaN,S
889,879,3,"Laleff, Mr. Kristo",male,NaN,0,0,NaN,S
890,889,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,NaN,S

In [27]:
stock_broker_data.drop('Stock_broker_id',axis=1,inplace=True)

In [28]:
stock_broker_data

,Knowledge_level,Name,Sex,Age,Certified_trainings_so_far,Increments_so_far,Seating_Location,Experience_level
0,3,"Thomas, Master. Assad Alexander",male,24.0,0,1,NaN,C
1,2,"Hamalainen, Master. Viljo",male,24.0,1,1,NaN,S
2,3,"Baclini, Miss. Helene Barbara",female,24.0,2,1,NaN,C
3,3,"Baclini, Miss. Eugenie",female,24.0,2,1,NaN,C
4,2,"Caldwell, Master. Alden Gates",male,24.0,0,2,NaN,S
...,...,...,...,...,...,...,...,...
886,3,"Razi, Mr. Raihed",male,NaN,0,0,NaN,C
887,3,"Sage, Miss. Dorothy Edith ""Dolly""",female,NaN,8,2,NaN,S
888,3,"van Melkebeke, Mr. Philemon",male,NaN,0,0,NaN,S
889,3,"Laleff, Mr. Kristo",male,NaN,0,0,NaN,S
890,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,NaN,S

In [ ]:
#removing unique_id from dataframe created

#original Dataframe(data): U_id,X_1,X_2,X_3,...X_9,Y

#step6: remove unique_id from our dataframe

#stock_broker_data=stock_broker_data.drop('Stock_broker_id',axis=1)


#original Dataframe: X_1,X_2,X_3,...X_9,Y

In [29]:
stock_broker_data.head()

,Knowledge_level,Name,Sex,Age,Certified_trainings_so_far,Increments_so_far,Seating_Location,Experience_level
0,3,"Thomas, Master. Assad Alexander",male,24.0,0,1,NaN,C
1,2,"Hamalainen, Master. Viljo",male,24.0,1,1,NaN,S
2,3,"Baclini, Miss. Helene Barbara",female,24.0,2,1,NaN,C
3,3,"Baclini, Miss. Eugenie",female,24.0,2,1,NaN,C
4,2,"Caldwell, Master. Alden Gates",male,24.0,0,2,NaN,S

In [30]:
#step7: remove target variable from our dataframe

#X_1,X_2,X_3,...X_9,Y

#stock_broker_data=stock_broker_data.drop('Succesful',axis=1)

#X_1,X_2,X_3,...X_9.... X

In [31]:
#stock_broker_data is having only features or independent variavles (X) (x_1,x_2,x_3)

In [32]:
stock_broker_data.columns

Index(['Knowledge_level', 'Name', 'Sex', 'Age', 'Certified_trainings_so_far',
       'Increments_so_far', 'Seating_Location', 'Experience_level'],
      dtype='object')

In [33]:
stock_broker_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 8 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   Knowledge_level             891 non-null    int64
 1   Name                        891 non-null    object
 2   Sex                         891 non-null    object
 3   Age                         714 non-null    float64
 4   Certified_trainings_so_far  891 non-null    int64
 5   Increments_so_far           891 non-null    int64
 6   Seating_Location            204 non-null    object
 7   Experience_level            889 non-null    object
dtypes: float64(1), int64(3), object(4)
memory usage: 55.8+ KB

In [34]:
stock_broker_data

,Knowledge_level,Name,Sex,Age,Certified_trainings_so_far,Increments_so_far,Seating_Location,Experience_level
0,3,"Thomas, Master. Assad Alexander",male,24.0,0,1,NaN,C
1,2,"Hamalainen, Master. Viljo",male,24.0,1,1,NaN,S
2,3,"Baclini, Miss. Helene Barbara",female,24.0,2,1,NaN,C
3,3,"Baclini, Miss. Eugenie",female,24.0,2,1,NaN,C
4,2,"Caldwell, Master. Alden Gates",male,24.0,0,2,NaN,S
...,...,...,...,...,...,...,...,...
886,3,"Razi, Mr. Raihed",male,NaN,0,0,NaN,C
887,3,"Sage, Miss. Dorothy Edith ""Dolly""",female,NaN,8,2,NaN,S
888,3,"van Melkebeke, Mr. Philemon",male,NaN,0,0,NaN,S
889,3,"Laleff, Mr. Kristo",male,NaN,0,0,NaN,S
890,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,NaN,S

In [35]:
#continous features .... numerical.... int64.. float 64
#categorical features..... object

#select_dtypes(include=['int64','float64'])

In [36]:
#object datatype in pandas has text or string data
#float64 datatype in pandas has numerical with decimal values
#int64 datatype in pandas has numerical without decimal values

#Numerical columns: float64 and int64
#categorical columns: object

In [37]:
stock_broker_data.select_dtypes(include=['float64','int64'])

     Knowledge_level   Age  Certified_trainings_so_far  Increments_so_far
0                  3  24.0                           0                  1
1                  2  24.0                           1                  1
2                  3  24.0                           2                  1
3                  3  24.0                           2                  1
4                  2  24.0                           0                  2
..               ...   ...                         ...                ...
886                3   NaN                           0                  0
887                3   NaN                           8                  2
888                3   NaN                           0                  0
889                3   NaN                           0                  0
890                3   NaN                           1                  2

[891 rows x 4 columns]

In [38]:
stock_broker_data.select_dtypes(include=['object'])

,Name,Sex,Seating_Location,Experience_level
0,"Thomas, Master. Assad Alexander",male,NaN,C
1,"Hamalainen, Master. Viljo",male,NaN,S
2,"Baclini, Miss. Helene Barbara",female,NaN,C
3,"Baclini, Miss. Eugenie",female,NaN,C
4,"Caldwell, Master. Alden Gates",male,NaN,S
...,...,...,...,...
886,"Razi, Mr. Raihed",male,NaN,C
887,"Sage, Miss. Dorothy Edith ""Dolly""",female,NaN,S
888,"van Melkebeke, Mr. Philemon",male,NaN,S
889,"Laleff, Mr. Kristo",male,NaN,S
890,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,S

In [39]:
#divide my data to numerical dataframe and categorical dataframe

#step8: create separate numerical dataframe for numerical columns inclusing both float64 and int64 datatypes

stock_broker_data_num=stock_broker_data.select_dtypes(include=['float64','int64'])

stock_broker_data_num_col=stock_broker_data_num.columns.tolist()

In [40]:
type(stock_broker_data_num)

pandas.core.frame.DataFrame

In [41]:
stock_broker_data_num.head()

   Knowledge_level   Age  Certified_trainings_so_far  Increments_so_far
0                3  24.0                           0                  1
1                2  24.0                           1                  1
2                3  24.0                           2                  1
3                3  24.0                           2                  1
4                2  24.0                           0                  2

In [42]:
#step9: create separate categorical dataframe for categorical columns including object datatype

stock_broker_data_cat=stock_broker_data.select_dtypes(include=['object'])

stock_broker_data_cat_col=stock_broker_data_cat.columns.tolist()

In [43]:
stock_broker_data_cat.head()

                              Name     Sex Seating_Location Experience_level
0  Thomas, Master. Assad Alexander    male              NaN                C
1        Hamalainen, Master. Viljo    male              NaN                S
2    Baclini, Miss. Helene Barbara  female              NaN                C
3           Baclini, Miss. Eugenie  female              NaN                C
4    Caldwell, Master. Alden Gates    male              NaN                S

In [ ]:
## functions explaination

"""
def fn_name(in_1,in_2):
    #computations (in_1,in_2)
    return out

fn_name()

In [44]:
#step10: 

#blackbox imputations
def show_missing(data):
    missing=data.columns[data.isnull().any()].tolist()
    return missing

In [45]:
missing_col_num=show_missing(stock_broker_data_num)

#count of missing records
missing_count_num=stock_broker_data_num[missing_col_num].isnull().sum()


#Identification of columns with missing values and thier counts

#impute them.... using central tendancy values

In [46]:
#numerical data
stock_broker_data_num.columns

Index(['Knowledge_level', 'Age', 'Certified_trainings_so_far',
       'Increments_so_far'],
      dtype='object')

In [47]:
#step 10 : identify columns with  missing values
missing_col_num

#what all numerical columns are having  missing values

['Age']

In [48]:
#step 11 : identify missing values count in that columns
missing_count_num

#how many missing values in that particular column

Age    177
dtype: int64

In [49]:
stock_broker_data_num['Age'].median()

28.0

In [50]:
stock_broker_data_num['Age'].mean()

32.74719887955182

In [51]:
#unravelling Blackbox

#missing=data.columns[data.isnull().any()].tolist()

In [52]:
stock_broker_data_num.head()

   Knowledge_level   Age  Certified_trainings_so_far  Increments_so_far
0                3  24.0                           0                  1
1                2  24.0                           1                  1
2                3  24.0                           2                  1
3                3  24.0                           2                  1
4                2  24.0                           0                  2

In [53]:
stock_broker_data_num.isnull()

     Knowledge_level    Age  Certified_trainings_so_far  Increments_so_far
0              False  False                       False              False
1              False  False                       False              False
2              False  False                       False              False
3              False  False                       False              False
4              False  False                       False              False
..               ...    ...                         ...                ...
886            False   True                       False              False
887            False   True                       False              False
888            False   True                       False              False
889            False   True                       False              False
890            False   True                       False              False

[891 rows x 4 columns]

In [54]:
#masked dataframe

In [55]:
stock_broker_data_num.isnull().any()

Knowledge_level               False
Age                            True
Certified_trainings_so_far    False
Increments_so_far             False
dtype: bool

In [56]:
stock_broker_data_num.columns

Index(['Knowledge_level', 'Age', 'Certified_trainings_so_far',
       'Increments_so_far'],
      dtype='object')

In [57]:
stock_broker_data_num.columns[stock_broker_data_num.isnull().any()] #filtering

Index(['Age'], dtype='object')

In [58]:
stock_broker_data_num.columns[stock_broker_data_num.isnull().any()].tolist()

['Age']

In [59]:
stock_broker_data_num['Age'].isnull()

0      False
1      False
2      False
3      False
4      False
       ...
886     True
887     True
888     True
889     True
890     True
Name: Age, Length: 891, dtype: bool

In [60]:
stock_broker_data_num['Age'].isnull().sum()

177

In [61]:
missing_col_num=stock_broker_data_num.columns[stock_broker_data_num.isnull().any()].tolist()

In [62]:
missing_col_num

['Age']

In [63]:
stock_broker_data_num[missing_col_num].isnull().sum()

Age    177
dtype: int64

In [64]:
#from sklearn.impute import SimpeImputer

#my_imputer=SimpeImputer(strategy='median')

#when you are starting the class(object creation) you should mention the strategy

#my_imputer.fit(stock_broker_data_num)....

#it understands and identifies where are missing values and with what it should impute with

In [65]:
#my_imputer.transform(stock_broker_data_num)......

#it will do the imputations..... Action

#my_imputer.fit_transform(stock_broker_data_num)

In [ ]:
        Age
1      
2
3
4

46     Null value

100

using 99 non null values .... computing central tendancy (strategy) .... fit method of imputer class

filling 46Th row..... Imputations  transform method of imputer class

fit(data_1)

transform(data_2)


fit_transform(data)

for many datascience process.... fit and transform...... fit_transform

In [66]:
#Imputations blackbox

#step12: imputing with strategy for filling the missing values

from sklearn.impute import SimpleImputer

imputer = SimpleImputer(strategy='median') 

stock_broker_data_num_after_impute=imputer.fit_transform(stock_broker_data_num)

stock_broker_data_num_after_impute_df=pd.DataFrame(stock_broker_data_num_after_impute,columns=stock_broker_data_num_col)

In [67]:
type(stock_broker_data_num_after_impute)

numpy.ndarray

In [68]:
stock_broker_data_num_after_impute

array([[ 3., 24.,  0.,  1.],
       [ 2., 24.,  1.,  1.],
       [ 3., 24.,  2.,  1.],
       ...,
       [ 3., 28.,  0.,  0.],
       [ 3., 28.,  0.,  0.],
       [ 3., 28.,  1.,  2.]])

In [69]:
#before imputation
missing_col_num_bf=show_missing(stock_broker_data_num)

In [70]:
missing_col_num_bf

['Age']

In [71]:
#after imputation
missing_col_num=show_missing(stock_broker_data_num_after_impute_df)

In [72]:
#step12: again recheck is there any column with missing values
missing_col_num

[]

In [73]:
#stock_broker_data_num_after_impute_df.to_csv('my_test_df.csv',index=False)


stock_broker_data_num.to_csv('my_test_df_bf_cmr.csv',index=False)

In [74]:
stock_broker_data_num_after_impute_df.to_csv('test_imputations_1_cmr.csv')

In [75]:
stock_broker_data_cat.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 4 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Name              891 non-null    object
 1   Sex               891 non-null    object
 2   Seating_Location  204 non-null    object
 3   Experience_level  889 non-null    object
dtypes: object(4)
memory usage: 28.0+ KB

In [76]:
891-204

687

In [77]:
stock_broker_data_cat=stock_broker_data_cat.drop(['Name','Seating_Location'],axis=1)

In [78]:
stock_broker_data_cat.head()

      Sex Experience_level
0    male                C
1    male                S
2  female                C
3  female                C
4    male                S

In [79]:
#blackbox encodings

#step13 create label encoded dummy variable for sex which is sex_cat
from sklearn.preprocessing import LabelEncoder
encoder= LabelEncoder()

stock_broker_data_cat['Sex_Cat'] = encoder.fit_transform(stock_broker_data_cat['Sex'])

In [80]:
stock_broker_data_cat.head()

      Sex Experience_level  Sex_Cat
0    male                C        1
1    male                S        1
2  female                C        0
3  female                C        0
4    male                S        1

In [81]:
##step13 create label encoded dummy variable for experience level which is experience_level_cat
stock_broker_data_cat['Experience_level_Cat'] = encoder.fit_transform(stock_broker_data_cat['Experience_level'].astype(str))

In [82]:
stock_broker_data_cat.head()

      Sex Experience_level  Sex_Cat  Experience_level_Cat
0    male                C        1                     0
1    male                S        1                     2
2  female                C        0                     0
3  female                C        0                     0
4    male                S        1                     2

In [83]:
#step14: drop or remove original categorical variables like sex and experience level
stock_broker_data_cat=stock_broker_data_cat.drop(['Sex','Experience_level'],axis=1)

In [84]:
stock_broker_data_cat.head()

   Sex_Cat  Experience_level_Cat
0        1                     0
1        1                     2
2        0                     0
3        0                     0
4        1                     2

In [85]:
stock_broker_data_num_after_impute_df.head()

   Knowledge_level   Age  Certified_trainings_so_far  Increments_so_far
0              3.0  24.0                         0.0                1.0
1              2.0  24.0                         1.0                1.0
2              3.0  24.0                         2.0                1.0
3              3.0  24.0                         2.0                1.0
4              2.0  24.0                         0.0                2.0

In [86]:
#lets assume we did all the preprocesings for both categorical and numerical dataframes

In [87]:
total_data=pd.concat([stock_broker_data_num_after_impute_df,stock_broker_data_cat],axis=1)

In [88]:
total_data.head()

,Knowledge_level,Age,Certified_trainings_so_far,Increments_so_far,Sex_Cat,Experience_level_Cat
0,3.0,24.0,0.0,1.0,1,0
1,2.0,24.0,1.0,1.0,1,2
2,3.0,24.0,2.0,1.0,0,0
3,3.0,24.0,2.0,1.0,0,0
4,2.0,24.0,0.0,2.0,1,2

In [89]:
total_data.shape

(891, 6)

In [90]:
#total_data=pd.concat([stock_broker_data_num_after_impute_df,stock_broker_data_cat],axis=1)

In [91]:
#target_variable

In [92]:
(X,y)

Development dataset

SyntaxError: invalid syntax (2820411933.py, line 3)

In [ ]:
"""
one set is given to you.... you will create two datasets

1) training set 75% of your total data
2) test set 25% of your total data

we are splitting our dataset into train and test datasets

In [93]:
#blackbox splitting data
from sklearn.model_selection import train_test_split

x_train, x_test, y_train, y_test = train_test_split(total_data, target_variable, test_size=0.25, random_state=42)

In [94]:
#x_train.to_csv('check_1.csv')

In [95]:
total_data

,Knowledge_level,Age,Certified_trainings_so_far,Increments_so_far,Sex_Cat,Experience_level_Cat
0,3.0,24.0,0.0,1.0,1,0
1,2.0,24.0,1.0,1.0,1,2
2,3.0,24.0,2.0,1.0,0,0
3,3.0,24.0,2.0,1.0,0,0
4,2.0,24.0,0.0,2.0,1,2
...,...,...,...,...,...,...
886,3.0,28.0,0.0,0.0,1,0
887,3.0,28.0,8.0,2.0,0,2
888,3.0,28.0,0.0,0.0,1,2
889,3.0,28.0,0.0,0.0,1,2
890,3.0,28.0,1.0,2.0,0,2

In [96]:
x_train.head(5)

,Knowledge_level,Age,Certified_trainings_so_far,Increments_so_far,Sex_Cat,Experience_level_Cat
298,3.0,25.0,0.0,0.0,1,2
884,3.0,28.0,8.0,2.0,1,2
247,3.0,24.0,0.0,0.0,1,2
478,3.0,34.5,0.0,0.0,1,0
305,3.0,26.0,0.0,0.0,1,2

In [97]:
x_train.shape

(668, 6)

In [98]:
891*0.75

668.25

In [99]:
x_test

,Knowledge_level,Age,Certified_trainings_so_far,Increments_so_far,Sex_Cat,Experience_level_Cat
709,3.0,70.5,0.0,0.0,1,1
439,1.0,32.0,0.0,0.0,1,0
840,3.0,28.0,0.0,0.0,1,2
720,1.0,28.0,1.0,0.0,0,0
39,3.0,24.0,1.0,1.0,1,2
...,...,...,...,...,...,...
880,3.0,28.0,0.0,0.0,1,1
425,3.0,31.0,0.0,0.0,1,2
101,2.0,24.0,0.0,0.0,0,2
199,1.0,24.0,0.0,0.0,0,2
424,2.0,31.0,1.0,1.0,0,2

In [100]:
x_test.shape

(223, 6)

In [101]:
y_train

298    0
884    0
247    0
478    0
305    0
      ..
106    0
270    1
860    0
435    0
102    0
Name: Succesful, Length: 668, dtype: int64

In [102]:
y_test

709    0
439    1
840    0
720    1
39     1
      ..
880    1
425    0
101    1
199    1
424    1
Name: Succesful, Length: 223, dtype: int64

In [103]:
#x_train, y_train...... training data.... 75% data

#x_test,  y_test

In [104]:
x_train.columns

Index(['Knowledge_level', 'Age', 'Certified_trainings_so_far',
       'Increments_so_far', 'Sex_Cat', 'Experience_level_Cat'],
      dtype='object')

In [105]:
x_train.shape[1]

6

In [106]:
#2160

#feature selection

#RFE

In [107]:
#balck box features selection
#recursive feature elimination technique
from sklearn.feature_selection import RFE
from sklearn.ensemble import RandomForestClassifier
RF=RandomForestClassifier(random_state=42)

rfe_RF=RFE(RF,n_features_to_select=4,verbose=21)

rfe_RF.fit(x_train,y_train)
names=x_train.columns.tolist()
b=rfe_RF.ranking_

#RFE: Recursive Feature Elimination is corresponding to Machine Learning Model.
#ranking is a attribute

a=pd.DataFrame(sorted(list(map(lambda x,y: (x,y),b,names))),columns=['rank','features'])
a.to_csv('feature_selection.csv')

RFE_selected=a['features'][a['rank']==1]

Fitting estimator with 6 features.
Fitting estimator with 5 features.

In [108]:
RFE_selected

0                           Age
1    Certified_trainings_so_far
2               Knowledge_level
3                       Sex_Cat
Name: features, dtype: object

In [109]:
x_train.head()

,Knowledge_level,Age,Certified_trainings_so_far,Increments_so_far,Sex_Cat,Experience_level_Cat
298,3.0,25.0,0.0,0.0,1,2
884,3.0,28.0,8.0,2.0,1,2
247,3.0,24.0,0.0,0.0,1,2
478,3.0,34.5,0.0,0.0,1,0
305,3.0,26.0,0.0,0.0,1,2

In [110]:
x_test.head()

,Knowledge_level,Age,Certified_trainings_so_far,Increments_so_far,Sex_Cat,Experience_level_Cat
709,3.0,70.5,0.0,0.0,1,1
439,1.0,32.0,0.0,0.0,1,0
840,3.0,28.0,0.0,0.0,1,2
720,1.0,28.0,1.0,0.0,0,0
39,3.0,24.0,1.0,1.0,1,2

In [111]:
RFE_selected

0                           Age
1    Certified_trainings_so_far
2               Knowledge_level
3                       Sex_Cat
Name: features, dtype: object

In [112]:
x_train=x_train[RFE_selected]

In [113]:
x_test=x_test[RFE_selected]

In [114]:
x_train.head()

      Age  Certified_trainings_so_far  Knowledge_level  Sex_Cat
298  25.0                         0.0              3.0        1
884  28.0                         8.0              3.0        1
247  24.0                         0.0              3.0        1
478  34.5                         0.0              3.0        1
305  26.0                         0.0              3.0        1

In [115]:
x_test.head()

      Age  Certified_trainings_so_far  Knowledge_level  Sex_Cat
709  70.5                         0.0              3.0        1
439  32.0                         0.0              1.0        1
840  28.0                         0.0              3.0        1
720  28.0                         1.0              1.0        0
39   24.0                         1.0              3.0        1

In [116]:
#black box Machine Learning model defualt models

from sklearn.ensemble import RandomForestClassifier
RF_model=RandomForestClassifier()
RF_model.fit(x_train,y_train)

#the training of model is done..... it learnt from the data.... what to do what not to do..... 
#it understood who are more successful and who are not

RandomForestClassifier()

In [117]:
RF_model

RandomForestClassifier()

In [118]:
#black box Machine Learning model

from sklearn.ensemble import RandomForestClassifier
RF_model=RandomForestClassifier(max_depth=3, max_features=0.6, min_samples_leaf=4,n_estimators=9)
RF_model.fit(x_train,y_train)

#the training of model is done..... it learnt from the data.... what to do what not to do..... 
#it understood who are more successful and who are not

RandomForestClassifier(max_depth=3, max_features=0.6, min_samples_leaf=4,
                       n_estimators=9)

In [119]:
RF_model

RandomForestClassifier(max_depth=3, max_features=0.6, min_samples_leaf=4,
                       n_estimators=9)

In [120]:
type(RF_model)

sklearn.ensemble._forest.RandomForestClassifier

In [121]:
#from sklearn.ensemble import RandomForestClassifier
#RF_model=RandomForestClassifier(n_estimators=1000)
#RF_model.fit(x_train,y_train)

In [122]:
#model training is done

In [123]:
# in training process, x_train and y_train participated.... so model has seen this data and it learnt from it. 

#but model did not see test data(25%)

In [124]:
#x_train,y_train

#training data

In [125]:
x_test.head()

      Age  Certified_trainings_so_far  Knowledge_level  Sex_Cat
709  70.5                         0.0              3.0        1
439  32.0                         0.0              1.0        1
840  28.0                         0.0              3.0        1
720  28.0                         1.0              1.0        0
39   24.0                         1.0              3.0        1

In [126]:
y_test

709    0
439    1
840    0
720    1
39     1
      ..
880    1
425    0
101    1
199    1
424    1
Name: Succesful, Length: 223, dtype: int64

In [127]:
#x_test,y_test

#test data

In [128]:
y_test #(True Values) #ground truth

709    0
439    1
840    0
720    1
39     1
      ..
880    1
425    0
101    1
199    1
424    1
Name: Succesful, Length: 223, dtype: int64

In [129]:
pred=RF_model.predict(x_test)

#this model knows nothing about x_test 

#we make predictions on test data

In [130]:
pred #predicted values #coming from the Model

array([0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 1,
       0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
       0, 0, 1, 0, 0, 1, 0, 0, 1, 0, 0, 0, 0, 1, 0, 1, 1, 0, 0, 0, 0, 0,
       0, 0, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0,
       0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1,
       1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0,
       0, 0, 0, 0, 0, 1, 0, 1, 0, 1, 0, 0, 1, 0, 0, 0, 0, 1, 1, 0, 1, 0,
       0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
       0, 0, 0, 1, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 1, 0, 0, 0,
       0, 1, 0, 0, 1, 1, 0, 0, 0, 0, 0, 1, 0, 1, 1, 1, 0, 0, 0, 1, 0, 0,
       1, 1, 1], dtype=int64)

In [131]:
#predicted values #true values....     evaluate model

In [132]:
out_data=pd.DataFrame({'true':y_test,'model_predicted':pred})

In [133]:
out_data.to_csv('my_first_predictions_analysis_cmr.csv')

In [134]:
preds=RF_model.predict(x_test)

In [135]:
#black box Evaluation metrics
from sklearn.metrics import accuracy_score
accuracy_test=accuracy_score(y_test, preds)

In [136]:
accuracy_test

0.7668161434977578

In [137]:
#Model evaulation metrics

In [138]:
#hyperparameters.....

#max_depth,max_features,n_estimators,criterion

In [139]:
from sklearn.model_selection import GridSearchCV

In [140]:
x_train.head()

      Age  Certified_trainings_so_far  Knowledge_level  Sex_Cat
298  25.0                         0.0              3.0        1
884  28.0                         8.0              3.0        1
247  24.0                         0.0              3.0        1
478  34.5                         0.0              3.0        1
305  26.0                         0.0              3.0        1

In [141]:
#hyper parameter tuning
#set of parameters to test
param_grid = {"n_estimators" : [90, 180, 270, 360, 450, 540, 630],
              "max_depth" : [2,3,5,7],
              "min_samples_leaf" : [2, 4],
              "max_features" : [0.4,0.5,0.6]
             }

#Use the GridSearchCV
RF_model=RandomForestClassifier() #estimator
clf = GridSearchCV(RF_model, param_grid, cv=3)
clf.fit(x_train,y_train)
clf.best_estimator_

RandomForestClassifier(max_depth=5, max_features=0.6, min_samples_leaf=4,
                       n_estimators=630)

In [142]:
clf.best_estimator_

RandomForestClassifier(max_depth=5, max_features=0.6, min_samples_leaf=4,
                       n_estimators=630)

In [144]:
preds=clf.best_estimator_.predict(x_test)

#black box Evaluation metrics
from sklearn.metrics import accuracy_score
accuracy_test=accuracy_score(y_test, preds)

In [145]:
accuracy_test

0.7982062780269058

In [146]:
import pickle as pk

my_first_out=open('my_first_pickle_file_withRFE_RF_cmr.pickle','wb')

pk.dump(clf.best_estimator_,my_first_out)

my_first_out.close()

In [ ]:
#just For later sake
#from sklearn.metrics import classification_report
#target_names = ['Successful', 'Not Successful']
#print(classification_report(y_test, preds, target_names=target_names))

In [ ]:
#improving the model performance ..... Tuning the model..... hyper parameter tuning using grid search